mynamelcz/NXP_KW41Z/DEV/SPI_SD/spi_sd.c
#include "spi_sd.h"
#include "fsl_dspi_cmsis.h"
#include "fsl_gpio.h"
#include "board.h"
#include "fsl_port.h"
#include "pin_mux.h"


/*******	DATA TRAN	TOKEN 	*******/
#define SD_START_DATA_SINGLE_BLOCK_READ    0xFE  //	Start Single Block Read 
#define SD_START_DATA_MULTIPLE_BLOCK_READ  0xFE  // Start Multiple Block Read 
#define SD_START_DATA_SINGLE_BLOCK_WRITE   0xFE  //	Start Single Block Write 
#define SD_START_DATA_MULTIPLE_BLOCK_WRITE 0xFC  // Start Multiple Block Write 
#define SD_STOP_DATA_MULTIPLE_BLOCK_WRITE  0xFD  // Stop Multiple Block Write 



/*******	SD 	CMD 	 	*******/
#define SD_CMD_GO_IDLE_STATE          0   /*!< CMD0 = 0x40 */
#define SD_CMD_SEND_OP_COND           1   /*!< CMD1 = 0x41 */
#define SD_CMD_IF_COND                8   /*!< CMD8 = 0x48 */
#define SD_CMD_SEND_CSD               9   /*!< CMD9 = 0x49 */
#define SD_CMD_SEND_CID               10  /*!< CMD10 = 0x4A */
#define SD_CMD_STOP_TRANSMISSION      12  /*!< CMD12 = 0x4C */
#define SD_CMD_SEND_STATUS            13  /*!< CMD13 = 0x4D */
#define SD_CMD_SET_BLOCKLEN           16  /*!< CMD16 = 0x50 */
#define SD_CMD_READ_SINGLE_BLOCK      17  /*!< CMD17 = 0x51 */
#define SD_CMD_READ_MULTIPLE_BLOCK    18  /*!< CMD18 = 0x52 */
#define SD_CMD_SEND_NUM_WR_BLOCKS     22  /*!< CMD22 = 0x56 */
#define SD_CMD_SET_BLOCK_COUNT        23  /*!< CMD23 = 0x57 */
#define SD_CMD_WRITE_SINGLE_BLOCK     24  /*!< CMD24 = 0x58 */
#define SD_CMD_WRITE_MULTIPLE_BLOCK   25  /*!< CMD25 = 0x59 */
#define SD_CMD_PROG_CSD               27  /*!< CMD27 = 0x5B */
#define SD_CMD_SET_WRITE_PROT         28  /*!< CMD28 = 0x5C */
#define SD_CMD_CLR_WRITE_PROT         29  /*!< CMD29 = 0x5D */
#define SD_CMD_SEND_WRITE_PROT        30  /*!< CMD30 = 0x5E */
#define SD_CMD_SD_ERASE_GRP_START     32  /*!< CMD32 = 0x60 */
#define SD_CMD_SD_ERASE_GRP_END       33  /*!< CMD33 = 0x61 */
#define SD_CMD_UNTAG_SECTOR           34  /*!< CMD34 = 0x62 */
#define SD_CMD_ERASE_GRP_START        35  /*!< CMD35 = 0x63 */
#define SD_CMD_ERASE_GRP_END          36  /*!< CMD36 = 0x64 */
#define SD_CMD_UNTAG_ERASE_GROUP      37  /*!< CMD37 = 0x65 */
#define SD_CMD_ERASE                  38  /*!< CMD38 = 0x66 */
//------------------------------------------------------------
#define SD_ACMD_SEND_OP_COND     	  41  /*!< ACMD41 */
#define SD_ACMD_SET_CLR_CARD_DETECT   42  /*!< ACMD42= 0x6A */
#define SD_CMD_APP_CMD                55  /*!< CMD55 = 0x77 */
#define SD_CMD_READ_OCR               58  /*!< CMD58 = 0x7A */
#define SD_CMD_CRC_ON_OFF             59  /*!< CMD59 = 0x7B */





static __spi_sd_obj *this_obj = NULL;

static u8 sd_speed_set(u32 speed)
{
	u8 res  = 0;
	res = this_obj->hd_io->io_ctr(SPI_SET_SPEED_CMD, (void *)&speed);	
	return res;
}


static u8 sd_get_state(void)
{
	return this_obj->sd_inf.dev_state;
}
static void sd_set_state(SD_Dev_state state)
{
	this_obj->sd_inf.dev_state = state;
}


static u8 sd_wait_ready(void)  
{  
    u32 t=0;  
	u8 dat = 0;
    do{  
		this_obj->hd_io->read(&dat, 1);
        if(dat == 0xff)return 0;
		//sd_printf("sd wait:0x%x t:%d\n",dat, t);
    }while(++t < 0xfff);
	ERR_printf(0);
    return 0xff;  
}  
  
static void sd_dis_select(void)  
{  
	u8 dat = 0;
    this_obj->hd_io->cs_str(1); 
    this_obj->hd_io->read(&dat, 1);
}  

static u8 sd_select(void)  
{  
	u8 res = 0;
    this_obj->hd_io->cs_str(0);   
    res = sd_wait_ready();
	if(res == 0xff)
		sd_dis_select();  
    return res; 
}  

static u8 sd_cmd_r1(u8 Cmd, u32 Arg, u8 Crc)
{
	u8 retry = 0xf;
	u8 cmd_fream[6];
	u8 r1 = 0xff;
    sd_dis_select();
	r1 = sd_select();
	if(r1) return r1;
	
	cmd_fream[0] = (Cmd | 0x40); 
	cmd_fream[1] = (u8)(Arg >> 24); 
	cmd_fream[2] = (u8)(Arg >> 16); 
	cmd_fream[3] = (u8)(Arg >> 8);
	cmd_fream[4] = (u8)(Arg); 
	cmd_fream[5] = (Crc | 0x01); 
    
	sd_printf("SD CMD%d: ",Cmd);
	sd_puthex((const char *)cmd_fream,6);
	

	retry = 100; 
	
	
	this_obj->hd_io->write(cmd_fream, 6);
	do
	{	
		this_obj->hd_io->read(&r1, SD_SPI_R1_LEN);
	}while ((r1 & SPI_R1_ALWAYS_0) && --retry); 

	if(retry == 0){
	    ERR_printf(0);
		return 0xff;
	}
	return r1;
}




static u8 sd_cmd(u8 Rx, u8 Cmd, u32 Arg, u8 Crc, u8 *r_buf)
{
	u8 r1 = 0xff;
	u8 len = 0;
	switch(Rx){
		case SD_SPI_R1:
		     len = SD_SPI_R1_LEN-1;
		     break;
		case SD_SPI_R2:
			 len = SD_SPI_R2_LEN-1;
			break;
		case SD_SPI_R3:
			len = SD_SPI_R3_LEN-1;
			break;
		case SD_SPI_R7:
			len = SD_SPI_R7_LEN-1;
			break;
		default:
			break;
	}
	 r1 = sd_cmd_r1(Cmd, Arg, Crc);
	 r_buf[0] = r1;
	 if(len){
		this_obj->hd_io->read(&(r_buf[1]), len);		 
	 }
	sd_printf("R%d: ",Rx);
	sd_puthex((const char *)r_buf, len+1);
	return r1;
}


//根据SPI时钟频率作相应修改
#define INIT_RETRY_MAX    400000
#define READ_BLOCK_MAX    200000 //200ms
#define WAIT_READY_MAX    500000 //500ms

spi_sd_err sd_check_res_token(u8 token)
{
	u32 retry = WAIT_READY_MAX; 
	// Check if response is got or a timeout is happen
	while ((this_obj->hd_io->w_r_byte(0xFF) != token) && --retry);
	if (retry){
		return SD_NO_ERR; // Right response got
	}else{
		ERR_printf(SD_ERR_CHECK_TOKEN);
		return SD_ERR_CHECK_TOKEN; // After time out
	}
}





static spi_sd_err sd_get_csd_reg(SD_CSD_T *sd_csd)
{
	spi_sd_err res = SD_NO_ERR;
	SD_Type sd_type = this_obj->sd_inf.type;
	u8 r1;
	u8 CSD_Tab[16];
	sd_cmd(SD_SPI_R1, SD_CMD_SEND_CSD, 0x00, 0xff, &r1);
	if(r1 != 0){
		sd_dis_select();
	    ERR_printf(0);
		return SD_ERR_GET_CSD;
	}
	res = sd_check_res_token(SD_START_DATA_SINGLE_BLOCK_READ);
	if(res != SD_NO_ERR){
		ERR_printf(0);
		return res;
	}
	this_obj->hd_io->read(CSD_Tab, 16);
	sd_dis_select();
	sd_printf("CSD: ");
	sd_puthex((const char *)CSD_Tab, 16);
	
	/*!< Byte 0 */	
	sd_csd->CSDStruct = (CSD_Tab[0] & 0xC0) >> 6;
	sd_csd->SysSpecVersion = (CSD_Tab[0] & 0x3C) >> 2;		// ????
	sd_csd->Reserved1 = CSD_Tab[0] & 0x03;					// ????
	

