mynamelcz/NXP_KW41Z/DEV/SPI_SD/spi_sd.c
	/*!< Byte 1 */
	sd_csd->TAAC = CSD_Tab[1];

	/*!< Byte 2 */
	sd_csd->NSAC = CSD_Tab[2];

	/*!< Byte 3 */
	sd_csd->MaxBusClkFrec = CSD_Tab[3];

	/*!< Byte 4 */
	sd_csd->CardComdClasses = CSD_Tab[4] << 4;

	/*!< Byte 5 */
	sd_csd->CardComdClasses |= (CSD_Tab[5] & 0xF0) >> 4;
	sd_csd->RdBlockLen = CSD_Tab[5] & 0x0F;
	
	/*!< Byte 6 */
	sd_csd->PartBlockRead = (CSD_Tab[6] & 0x80) >> 7;
	sd_csd->WrBlockMisalign = (CSD_Tab[6] & 0x40) >> 6;
	sd_csd->RdBlockMisalign = (CSD_Tab[6] & 0x20) >> 5;
	sd_csd->DSRImpl = (CSD_Tab[6] & 0x10) >> 4;
	sd_csd->Reserved2 = 0; /*!< Reserved */

	if (sd_type == SD_TYPE_SDHC) // or SDXC CSD v2.0
	{
		/*!< Byte 7 */
        sd_csd->DeviceSize = (CSD_Tab[7] & 0x3F) << 16;

        /*!< Byte 8 */
        sd_csd->DeviceSize |= (CSD_Tab[8] << 8);

        /*!< Byte 9 */
        sd_csd->DeviceSize |= (CSD_Tab[9]);
	}
	else if (sd_type == SD_TYPE_V1_X || sd_type == SD_TYPE_SDSC) //CSD v1.0
	{
		sd_csd->DeviceSize = (CSD_Tab[6] & 0x03) << 10;
		/*!< Byte 7 */
		sd_csd->DeviceSize |= (CSD_Tab[7]) << 2;

		/*!< Byte 8 */
		sd_csd->DeviceSize |= (CSD_Tab[8] & 0xC0) >> 6;

		sd_csd->MaxRdCurrentVDDMin = (CSD_Tab[8] & 0x38) >> 3;
		sd_csd->MaxRdCurrentVDDMax = (CSD_Tab[8] & 0x07);

		/*!< Byte 9 */
		sd_csd->MaxWrCurrentVDDMin = (CSD_Tab[9] & 0xE0) >> 5;
		sd_csd->MaxWrCurrentVDDMax = (CSD_Tab[9] & 0x1C) >> 2;
		sd_csd->DeviceSizeMul = (CSD_Tab[9] & 0x03) << 1;

		/*!< Byte 10 */
		sd_csd->DeviceSizeMul |= (CSD_Tab[10] & 0x80) >> 7;
	}
	
	sd_csd->EraseGrSize = (CSD_Tab[10] & 0x40) >> 6;
	sd_csd->EraseGrMul = (CSD_Tab[10] & 0x3F) << 1;

	/*!< Byte 11 */
	sd_csd->EraseGrMul |= (CSD_Tab[11] & 0x80) >> 7;
	sd_csd->WrProtectGrSize = (CSD_Tab[11] & 0x7F);

	/*!< Byte 12 */
	sd_csd->WrProtectGrEnable = (CSD_Tab[12] & 0x80) >> 7;
	sd_csd->ManDeflECC = (CSD_Tab[12] & 0x60) >> 5;
	sd_csd->WrSpeedFact = (CSD_Tab[12] & 0x1C) >> 2;
	sd_csd->MaxWrBlockLen = (CSD_Tab[12] & 0x03) << 2;

	/*!< Byte 13 */
	sd_csd->MaxWrBlockLen |= (CSD_Tab[13] & 0xC0) >> 6;
	sd_csd->WriteBlockPaPartial = (CSD_Tab[13] & 0x20) >> 5;
	sd_csd->Reserved3 = 0;
	sd_csd->ContentProtectAppli = (CSD_Tab[13] & 0x01);

	/*!< Byte 14 */
	sd_csd->FileFormatGroup = (CSD_Tab[14] & 0x80) >> 7;
	sd_csd->CopyFlag = (CSD_Tab[14] & 0x40) >> 6;
	sd_csd->PermWrProtect = (CSD_Tab[14] & 0x20) >> 5;
	sd_csd->TempWrProtect = (CSD_Tab[14] & 0x10) >> 4;
	sd_csd->FileFormat = (CSD_Tab[14] & 0x0C) >> 2;
	sd_csd->ECC = (CSD_Tab[14] & 0x03);

	/*!< Byte 15 */
	sd_csd->CSD_CRC = (CSD_Tab[15] & 0xFE) >> 1;
	sd_csd->Reserved4 = 1;
	
//	sd_printf("CSDStruct:\t0x%x \n",sd_csd->CSDStruct);
//	sd_printf("SysSpecVersion:\t0x%x \n",sd_csd->SysSpecVersion);
//	sd_printf("Reserved1\t0x%x \n",sd_csd->Reserved1);

//	sd_printf("TAAC:\t\t0x%x \n",sd_csd->TAAC);
//	sd_printf("NSAC:\t\t0x%x \n",sd_csd->NSAC);
//	sd_printf("MaxBusClkFrec\t0x%x \n",sd_csd->MaxBusClkFrec);	//0x32:25M 0x5A:50M 

//	sd_printf("CardComdClasses\t0x%x \n",sd_csd->CardComdClasses);	
//	sd_printf("RdBlockLen\t0x%x \n",sd_csd->RdBlockLen);	

//	sd_printf("PartBlockRead\t0x%x \n",sd_csd->PartBlockRead);
//	sd_printf("WrBlockMisalign\t0x%x \n",sd_csd->WrBlockMisalign);
//	sd_printf("RdBlockMisalign\t0x%x \n",sd_csd->RdBlockMisalign);
//	sd_printf("DSRImpl  \t0x%x \n",sd_csd->DSRImpl);
//	sd_printf("Reserved2\t0x%x \n",sd_csd->Reserved2);

//	sd_printf("DeviceSize\t0x%x \n",sd_csd->DeviceSize);
//	sd_printf("MaxRdCurrentVDDMin\t0x%x \n",sd_csd->MaxRdCurrentVDDMin);
//	sd_printf("MaxWrCurrentVDDMax\t0x%x \n",sd_csd->MaxWrCurrentVDDMax);
//	sd_printf("DeviceSizeMul\t0x%x \n",sd_csd->DeviceSizeMul);


	return res;

}

#if 0
static spi_sd_err sd_get_cid_reg(SD_CID_T *sd_cid)
{
	spi_sd_err res = SD_NO_ERR;

	u8 r1;
	u8 CID_Tab[16];
	sd_cmd(SD_SPI_R1, SD_CMD_SEND_CID, 0x00, 0xff, &r1);
	if(r1 != 0){
		sd_dis_select();
	    ERR_printf(0);
		return SD_ERR_GET_CSD;
	}
	res = sd_check_res_token(SD_START_DATA_SINGLE_BLOCK_READ);
	if(res != SD_NO_ERR){
		return res;
	}
	this_obj->hd_io->read(CID_Tab, 16);
	sd_dis_select();
	sd_printf("CID: ");
	sd_puthex((const char *)CID_Tab, 16);
	
	
	/*!< Byte 0 */
	sd_cid->ManufacturerID = CID_Tab[0];

	/*!< Byte 1 */
	sd_cid->OEM_AppliID = CID_Tab[1] << 8;

	/*!< Byte 2 */
	sd_cid->OEM_AppliID |= CID_Tab[2];

	/*!< Byte 3 */
	sd_cid->ProdName1 = CID_Tab[3] << 24;

	/*!< Byte 4 */
	sd_cid->ProdName1 |= CID_Tab[4] << 16;

	/*!< Byte 5 */
	sd_cid->ProdName1 |= CID_Tab[5] << 8;

	/*!< Byte 6 */
	sd_cid->ProdName1 |= CID_Tab[6];

	/*!< Byte 7 */
	sd_cid->ProdName2 = CID_Tab[7];

	/*!< Byte 8 */
	sd_cid->ProdRev = CID_Tab[8];

	/*!< Byte 9 */
	sd_cid->ProdSN = CID_Tab[9] << 24;

	/*!< Byte 10 */
	sd_cid->ProdSN |= CID_Tab[10] << 16;

	/*!< Byte 11 */
	sd_cid->ProdSN |= CID_Tab[11] << 8;

	/*!< Byte 12 */
	sd_cid->ProdSN |= CID_Tab[12];

	/*!< Byte 13 */
	sd_cid->Reserved1 |= (CID_Tab[13] & 0xF0) >> 4;
	sd_cid->ManufactDate = (CID_Tab[13] & 0x0F) << 8;

	/*!< Byte 14 */
	sd_cid->ManufactDate |= CID_Tab[14];

	/*!< Byte 15 */
	sd_cid->CID_CRC = (CID_Tab[15] & 0xFE) >> 1;
	sd_cid->Reserved2 = 1;

//	sd_printf("ManufacturerID\t0x%x \n",sd_cid->ManufacturerID);
//	sd_printf("OEM_AppliID\t0x%x \n",sd_cid->OEM_AppliID);
//	sd_printf("ProdName1\t0x%x \n",sd_cid->ProdName1);
//	sd_printf("ProdName2\t0x%x \n",sd_cid->ProdName2);
//	sd_printf("ProdRev    \t0x%x \n",sd_cid->ProdRev);
//	sd_printf("ProdSN    \t0x%x \n",sd_cid->ProdSN);
//	sd_printf("Reserved1\t0x%x \n",sd_cid->Reserved1);
//	sd_printf("CID_CRC    \t0x%x \n",sd_cid->CID_CRC);
//	sd_printf("Reserved2\t0x%x \n",sd_cid->Reserved2);

	/*!< Return the reponse */
	return res;	
}	

#endif



spi_sd_err sd_getcard_inf(__sd_inf_t *sd_inf)
{
	spi_sd_err res = SD_NO_ERR;
	SD_Type sd_type = sd_inf->type;
	res = sd_get_csd_reg(&(this_obj->sd_inf.CSD));
//	res = sd_get_cid_reg(&(this_obj->sd_inf.CID));
	if (sd_type == SD_TYPE_SDHC)
	{
		sd_inf->capacity = ((unsigned long long)sd_inf->CSD.DeviceSize + 1) * 512;
        sd_inf->block_sz = 512;
	}
	else if (sd_type == SD_TYPE_SDSC || sd_type == SD_TYPE_V1_X)
	{
		sd_inf->capacity = (sd_inf->CSD.DeviceSize + 1);
		sd_inf->capacity *= (1 << (sd_inf->CSD.DeviceSizeMul + 2));
		sd_inf->block_sz = 1 << (sd_inf->CSD.RdBlockLen);
		sd_inf->capacity *= sd_inf->block_sz;
		
		sd_inf->capacity >>= 10;
	}
	sd_printf("DeviceSize\t0x%x \n",sd_inf->CSD.DeviceSize);
	sd_printf("block_sz\t0x%x \n",sd_inf->block_sz);
	sd_printf("capacity\t %d  Kb\n",sd_inf->capacity);
	sd_printf("Reserved2\t0x%x \n",sd_inf->type);


	
	
	return res;
}
	
	




