mynamelcz/NXP_KW41Z/DEV/SPI_SD/spi_sd.c
static spi_sd_err sd_idle_mode(void)
{
	u8 tmp_buf[15];
	u8 retry = 12;
	u8 r1 = 0xff;
	//0: Reset card  >74  clk **/
	sd_speed_set(SD_CLK_SPEED_LOW);

    this_obj->hd_io->cs_str(1);	

	this_obj->hd_io->read(tmp_buf, 10);
	do{// CMD0--> idle mode **/
		r1 = sd_cmd(SD_SPI_R1, SD_CMD_GO_IDLE_STATE, 0x00, 0x95, &r1);
	}while((r1 != SPI_R1_IDLE_STATE)&&(--retry));
	if(retry == 0){
	    ERR_printf(0);
		return SD_ERR_GO_IDLE;
	}
	return SD_NO_ERR;
}



static u32 block_convey_addr(u32 block)
{
	if((spi_sd_obj.sd_inf.type == SD_TYPE_SDHC)||
	   (spi_sd_obj.sd_inf.type == SD_TYPE_SDXC)){
		return block;
	}
	return (block * spi_sd_obj.sd_inf.block_sz);
}




static spi_sd_err identification_v1_card(void)
{
	u8 retry, r1;
	u8 rx_buf[5] = {0};
    this_obj->hd_io->w_r_byte(0xff);			//提高可靠性
	this_obj->hd_io->w_r_byte(0xff);
    retry = MAX_RETRY_TIME;		 
	do{															// ACMD41: 1.send host capacity support information  2.Active teh card
		r1 = sd_cmd(SD_SPI_R1, SD_CMD_APP_CMD, 0, 0xFF, rx_buf);
#if(HOST_SUPPORT_HIGH_CAP)
		r1 = sd_cmd(SD_SPI_R1, SD_ACMD_SEND_OP_COND, 0x40000000, 0xFF, rx_buf);			// HCS = 1 
#else			
		r1 = sd_cmd(SD_SPI_R1, SD_ACMD_SEND_OP_COND, 0x00000000, 0xFF, rx_buf);			// HCS = 0  
#endif			
	}while(r1 && --retry);		 
	if(r1 != 0){
        ERR_printf(0);
		this_obj->sd_inf.type = SD_TYPE_UNKNOW;	
        return SD_ERR_CHECK_V1;		
	}
	sd_printf(">>>> SD TYPE V1.x ==<<<<<<\n");
	this_obj->sd_inf.type = SD_TYPE_V1_X;
	return SD_NO_ERR;
}


static spi_sd_err identification_v2v3(void)
{
	u32 retry, r1;
	u8 rx_buf[5] = {0};
    this_obj->hd_io->w_r_byte(0xff);			//提高可靠性
	this_obj->hd_io->w_r_byte(0xff);
	this_obj->hd_io->w_r_byte(0xff);
	this_obj->hd_io->w_r_byte(0xff);
	this_obj->hd_io->w_r_byte(0xff);
    retry = MAX_RETRY_TIME;		 
	do{// ACMD41: 1.send host capacity support information 2.Active teh card
		r1 = sd_cmd(SD_SPI_R1, SD_CMD_APP_CMD, 0, 0xFF, rx_buf);
#if(HOST_SUPPORT_HIGH_CAP)
		r1 = sd_cmd(SD_SPI_R1, SD_ACMD_SEND_OP_COND, 0x40000000, 0xFF, rx_buf);			// HCS = 1 
#else			
		r1 = sd_cmd(SD_SPI_R1, SD_ACMD_SEND_OP_COND, 0x00000000, 0xFF, rx_buf);			// HCS = 0  
#endif			
	}while(r1 && --retry);
	if(r1 != 0){
        ERR_printf(0);
		return  SD_ERR_CHECK_V2V3;			
	}	 
	r1 = sd_cmd(SD_SPI_R3, SD_CMD_READ_OCR, 0, 0XFF, rx_buf);	// CMD58:  GET  CCS		 
	if(rx_buf[1] & 0x40){
		sd_printf(">>>> SDHC or SDXC card ==<<<<<<\n");
		this_obj->sd_inf.type = SD_TYPE_SDHC;
		return SD_NO_ERR;			
	}else{
		sd_printf(">>>> SDSC  card ==<<<<<<\n");
	    this_obj->sd_inf.type = SD_TYPE_SDSC;
		return SD_NO_ERR;	
	} 		
}
static spi_sd_err sd_identification(void)
{
	u8 r1;
	u8 rx_buf[5] = {0};
	spi_sd_err res = SD_NO_ERR;
    res = sd_idle_mode();
	if(res != SD_NO_ERR){
        ERR_printf(0);
		return res;		
	}

	r1 = sd_cmd(SD_SPI_R7, SD_CMD_IF_COND, 0x01AA, 0x87, rx_buf);	//CMD8: check 2.7v~3.6v
	
	if(r1&SPI_R1_ILL_CMD){
		res = identification_v1_card();
	 }else if((rx_buf[3] == 0x01)&&(rx_buf[4]==0xAA)){
		res = identification_v2v3();
	 }else{
        res = identification_v2v3();
	 }
	 return res;
}



static bool sd_io_control(u8 cmd, void *buff)
{
    u8 res = false;
    switch(cmd){
/* Generic command (Used by FatFs) */
//        case SD_CTRL_SYNC:			//make sure write end
//			res = true;			    //default ok;  因为写入时已经有等待写入完成，所以这里默认ok
//            break;
//        case SD_GET_SECTOR_COUNT:	
//            *((u32 *)buff) = this_obj->sd_inf.capacity/ this_obj->sd_inf.block_sz;
//            res = true;
//            break;
//        case SD_GET_SECTOR_SIZE:
//            *((u32 *)buff) = (u32)this_obj->sd_inf.block_sz;
//            res = true;
//            break;
//        case SD_GET_BLOCK_SIZE:
//            *((u32 *)buff) = 1;
//            res = true;
//            break;
//        case SD_CTRL_TRIM:
//            break;
///* Generic command (Not used by FatFs) */
//        case SD_CTRL_POWER:
//            break;
//        case SD_CTRL_LOCK:
//            break;
//        case SD_CTRL_EJECT:
//            break;
//        case SD_CTRL_FORMAT:
//            break;
/*    user cmd   */		
		case SD_CTRL_GET_SIZE:
			break;
		case SD_CTRL_POWER_ON:
			break;	
		case SD_CTRL_POWER_OFF:
			break;			
		default:
			break;

    }
    if(res == false){
        ERR_printf(0);
    }
    return res;
} 





/*============	读写函数	=============*/
/*
*	1. addr shall aligned to block boundary
	   a. SDHC clock is 512-Byte
	   b. addr  在SDHC中以(block) 512-byte为单位, 
		    	在SDSC中以byte为单位。
*/
static u8 sd_read_blk(u8 *buf, u32 start_blk, u16 blk_bum)
{
	ASSERT(buf);
	u32 retry = MAX_RETRY_TIME;
	u8 res = 0xff;
	u16 crc = 0;
	u8 *ptr = buf;
	u16 blk_sz = this_obj->sd_inf.block_sz;
	
	u32 addr = 0;
	addr = block_convey_addr(start_blk);
	if(blk_bum ==1){
		sd_cmd(SD_SPI_R1, SD_CMD_READ_SINGLE_BLOCK, addr, 0xFF, &res);
		if(res != 0){
	        ERR_printf(0);
			return res;
		}
		res = sd_check_res_token(SD_START_DATA_SINGLE_BLOCK_READ);
		if(res == SD_NO_ERR){
			this_obj->hd_io->read(buf,blk_sz);
			this_obj->hd_io->read((u8 *)(&crc),sizeof(crc));
		}
		sd_dis_select();
		return res;	
	}else if(blk_bum > 1){
	
		sd_cmd(SD_SPI_R1, SD_CMD_READ_MULTIPLE_BLOCK, addr, 0xFF, &res);
		if(res != 0){
	        ERR_printf(0);
			return res;
		}
		while(blk_bum--){
			res = sd_check_res_token(SD_START_DATA_MULTIPLE_BLOCK_READ);
			if(res == SD_NO_ERR){
				this_obj->hd_io->read(ptr,blk_sz);
				this_obj->hd_io->read((u8 *)(&crc),sizeof(crc));
				ptr += blk_sz;
			}else{
				ERR_printf(0);
			}
		}
		do{
			sd_cmd(SD_SPI_R1, SD_CMD_STOP_TRANSMISSION, 0x00, 0xFF, &res);
		}while((res==0)&&(--retry));		// res:0 indicate sd is not busy
		if(retry == 0){
            
			ERR_printf(0);
			res = 0xff;
		}
		sd_dis_select();
		return res;	
	}else{;}
	return res;	
}


static u8 sd_write_blk(const u8 *buf, u32 start_blk, u16 blk_bum)
{
	ASSERT(buf);
	u8 res = 0xff;
	u8 data_res = 0;
	u16 crc = 0xffff;
    const u8 * ptr = buf;
	u16 blk_sz = this_obj->sd_inf.block_sz;
	
	u32 addr = 0;
	addr = block_convey_addr(start_blk);
	
	if(blk_bum==1){
		sd_cmd(SD_SPI_R1, SD_CMD_WRITE_SINGLE_BLOCK, addr, 0xFF, &res);		//CMD24
		if(res != 0){
            ERR_printf(0);
			return res;
		}	
		this_obj->hd_io->w_r_byte(SD_START_DATA_SINGLE_BLOCK_WRITE);		//token
		this_obj->hd_io->write(buf, blk_sz);								//data
		this_obj->hd_io->write((u8 *)(&crc),sizeof(crc));					//crc
		this_obj->hd_io->read(&data_res , 1);								//data res
		if(data_res & 0x5){
			res = 0;	
		}else{
            ERR_printf(0);
			res = 0xff;				
		}
		sd_dis_select();
		return res;
		
	}else if(blk_bum >1){
		sd_cmd(SD_SPI_R1, SD_CMD_WRITE_MULTIPLE_BLOCK, 0, 0xFF, &res);
		if(res != 0){
            ERR_printf(0);
			return res;
		}
		while(blk_bum--){
		
			this_obj->hd_io->w_r_byte(SD_START_DATA_MULTIPLE_BLOCK_WRITE);		//token
			this_obj->hd_io->write(ptr, blk_sz);								//data
			this_obj->hd_io->write((u8 *)(&crc),sizeof(crc));					//crc
			this_obj->hd_io->read(&data_res , 1);								//data res
			ptr += blk_sz;		
			if(data_res & 0x5){
				res = 0;	
			}else{
                ERR_printf(0);
				res = 0xff;	
				break;
			}
			res=sd_wait_ready();
			if(res){
				break;
			}
		}
        this_obj->hd_io->w_r_byte(SD_STOP_DATA_MULTIPLE_BLOCK_WRITE);		   //token
		sd_dis_select();
		return res;
	}else{
	
