mynamelcz/NXP_KW41Z/DEV/SPI_SD/spi_sd.c
	}
	return 0;
}
/*============	SD 卡初始化	=============*/
static spi_sd_err sd_init(__spi_ctr_obj  *hd_io)
{
	sd_printf("FUN:%s\n",__func__);
	ASSERT(hd_io);
	ASSERT(hd_io->read);
	ASSERT(hd_io->write);
    spi_sd_err res;
	u8 r1;
    this_obj = &spi_sd_obj;
	this_obj->hd_io = hd_io;
	this_obj->sd_inf.type = SD_TYPE_UNKNOW;	
    
	if(sd_get_state() == SD_STA_ON_LINE){	// already init
		return SD_NO_ERR;
	}

    res = sd_identification();
	
	if(res != SD_NO_ERR){
        ERR_printf(0);
		return res;
	}
	
	sd_cmd(SD_SPI_R1, SD_CMD_CRC_ON_OFF, 0x00, 0xFF, &r1);			// CMD59 关闭 CRC 校验
	sd_cmd(SD_SPI_R1, SD_CMD_CRC_ON_OFF, 0x00, 0xFF, &r1);
	sd_cmd(SD_SPI_R1, SD_CMD_CRC_ON_OFF, 0x00, 0xFF, &r1);
	
	sd_cmd(SD_SPI_R1, SD_CMD_SET_BLOCKLEN, SD_BLOCK_SIZE, 0xFF, &r1);// CMD16 设置 BLOCK 为 512 Bytes (对 SDHC/SDHX 无效)
	if(r1){
        ERR_printf(0);
		return SD_ERR_SET_BLOCK_SIZE;
	}	
	sd_dis_select();
	sd_speed_set(SD_CLK_SPEED_HIGH);
    sd_getcard_inf(&this_obj->sd_inf);
	
	spi_sd_obj.sd_inf.block_sz = SD_BLOCK_SIZE;
	
	sd_set_state(SD_STA_ON_LINE);
	return SD_NO_ERR;
}

/////////////////////////////////////////////////////////////////////////////////
/*****	>>> soft spi <<<	****/
typedef enum __SPI_TYPE{
	CPOL0_CPHA0,		// CLK  LOW,  1 age
	CPOL0_CPHA1,		// CLK  LOW,  2 age
	CPOL1_CPHA0,
	CPOL1_CPHA1,
}SPI_TYPE_E;

typedef struct _soft_spi_io {
	SPI_TYPE_E type;
	u8  (*MISO)(void);
	void (*MOSI)(u8 en);
	void (*CLK)(u8 en);
}Soft_SPI_hd;

volatile u32 delay_cnt_g = 100;

static void soft_spi_delay(u32 delay)
{
	u32 tmp = delay;
	while(delay--);
	delay_cnt_g = tmp;
}
static u8 soft_spi_tx_rx_byte(Soft_SPI_hd *hd, u8 s_dat)
{
	u8 i = 0;
	u8 r_dat = 0;
	if(hd->type == CPOL0_CPHA0){
		hd->CLK(0);
		soft_spi_delay(delay_cnt_g);
		for(;i<8;i++){		
			if(s_dat & (0x80 >> i)){
				hd->MOSI(1);
			}else{
				hd->MOSI(0);
			}
			soft_spi_delay(delay_cnt_g);
			hd->CLK(1);
			soft_spi_delay(delay_cnt_g);
			
			r_dat <<= 1;
			if(hd->MISO()) r_dat++;
			
			hd->CLK(0);	
			soft_spi_delay(delay_cnt_g);
		}
	}
	if(hd->type == CPOL0_CPHA1){
		hd->CLK(0);
		soft_spi_delay(delay_cnt_g);
		for(;i<8;i++){	
			hd->CLK(1);
			soft_spi_delay(delay_cnt_g);
			if(s_dat & (0x80 >> i)){
				hd->MOSI(1);
			}else{
				hd->MOSI(0);
			}
			soft_spi_delay(delay_cnt_g);	
			hd->CLK(0);				
			r_dat <<= 1;
			if(hd->MISO()) r_dat++;
			soft_spi_delay(delay_cnt_g);
		}
	}
	if(hd->type == CPOL1_CPHA0){
		hd->CLK(1);
		soft_spi_delay(delay_cnt_g);
		for(;i<8;i++){		
			if(s_dat & (0x80 >> i)){
				hd->MOSI(1);
			}else{
				hd->MOSI(0);
			}
			soft_spi_delay(delay_cnt_g);	
			hd->CLK(0);
			soft_spi_delay(delay_cnt_g);	
			r_dat <<= 1;
			if(hd->MISO()) r_dat++;
			hd->CLK(1);	
			soft_spi_delay(delay_cnt_g);
		}
	}
	if(hd->type == CPOL1_CPHA1){
		hd->CLK(1);
		soft_spi_delay(delay_cnt_g);
		for(;i<8;i++){	
			hd->CLK(0);	
			soft_spi_delay(delay_cnt_g);
			if(s_dat & (0x80 >> i)){
				hd->MOSI(1);
			}else{
				hd->MOSI(0);
			}
			soft_spi_delay(delay_cnt_g);
			hd->CLK(1);				
			r_dat <<= 1;
			if(hd->MISO()) r_dat++;	
			soft_spi_delay(delay_cnt_g);
		}	
	}
	return r_dat;
}

static void soft_spi_send_buf(Soft_SPI_hd *hd, const u8 *buf, u32 len)
{
	ASSERT(buf);
	const u8 *ptr = buf;
	if(len == 0) return;
	while(len--){
		soft_spi_tx_rx_byte(hd,*ptr++);
	}
}
static void soft_spi_read_buf(Soft_SPI_hd *hd, u8 *buf, u32 len)
{
	ASSERT(buf);
	u8 *ptr = buf;
	if(len == 0) return;
	while(len--){
		*ptr++ = soft_spi_tx_rx_byte(hd, 0xFF);
	}
}


Soft_SPI_hd soft_spi_hd;
static void soft_spi_cs(u8 en)
{
	en?GPIO_SetPinsOutput(SD_SPI_CS_GPIO, 1<<SD_SPI_CS_PIN):\
	   GPIO_ClearPinsOutput(SD_SPI_CS_GPIO, 1<<SD_SPI_CS_PIN);
}
static u8 soft_spi_miso(void)
{
	return GPIO_ReadPinInput(SD_SPI_MISO_GPIO, SD_SPI_MISO_PIN);
}
static void soft_spi_mosi(u8 en)
{
	en?GPIO_SetPinsOutput(SD_SPI_MOSI_GPIO, 1<<SD_SPI_MOSI_PIN):\
	   GPIO_ClearPinsOutput(SD_SPI_MOSI_GPIO, 1<<SD_SPI_MOSI_PIN);
}
static void soft_spi_clk(u8 en)
{
	en?GPIO_SetPinsOutput(SD_SPI_CLK_GPIO, 1<<SD_SPI_CLK_PIN):\
	   GPIO_ClearPinsOutput(SD_SPI_CLK_GPIO, 1<<SD_SPI_CLK_PIN);
}
static bool soft_spi_ioctr(u8 cmd, void *buf)
{
	u8 res = false;
	return true;
}



static void spi_init(void)
{
    spi_obj.cs_str = soft_spi_cs;
    soft_spi_hd.type = CPOL0_CPHA0;
	soft_spi_hd.CLK = soft_spi_clk;
	soft_spi_hd.MISO= soft_spi_miso;
	soft_spi_hd.MOSI= soft_spi_mosi;
	
	port_pin_config_t config = {
      kPORT_PullUp ,
      kPORT_FastSlewRate,
      kPORT_PassiveFilterDisable,
      kPORT_LowDriveStrength,
      kPORT_MuxAsGpio,
	};
	PORT_SetMultiplePinsConfig(PORTC, SD_SPI_CS_PIN_M|
	                                  SD_SPI_CLK_PIN_M|
	                                  SD_SPI_MOSI_PIN_M|
	                                  SD_SPI_MISO_PIN_M, &config);	
	
	
	GPIOC->PDDR |= (SD_SPI_CS_PIN_M|SD_SPI_CLK_PIN_M|SD_SPI_MOSI_PIN_M);
	GPIOC->PDDR &= ~(SD_SPI_MISO_PIN_M);

}

static void spi_send_buf(const u8 *pData, uint32_t Size)
{
	soft_spi_send_buf(&soft_spi_hd, pData, Size);
}

static void spi_read_buf(uint8_t *pData, uint32_t Size)
{
	soft_spi_read_buf(&soft_spi_hd, pData, Size);
}

static u8 spi_send_read_byte(u8 dat)
{
	return soft_spi_tx_rx_byte(&soft_spi_hd, dat);
}
static u8 spi_ioctr(u32 cmd, void *buf)
{
	u8 res = false;

	return true;
}







__spi_ctr_obj spi_obj = {
	.cs_str = NULL,
	.init 	= spi_init,
	.read   = spi_read_buf,
	.write  = spi_send_buf,
	.w_r_byte = spi_send_read_byte,
	.io_ctr = spi_ioctr,
};

__spi_sd_obj spi_sd_obj = {

	.init 	= sd_init,
	.read 	= sd_read_blk,
	.write 	= sd_write_blk,
	.io_ctr = sd_io_control,
	.status = sd_get_state,
};
/*****=== soft spi end ===****/

#if 0 
static volatile bool isTransferCompleted = false;
static volatile bool isMasterOnTransmit = false;
static volatile bool isMasterOnReceive = false;


static void DSPI_MasterSignalEvent_t(uint32_t event)
{
    if (true == isMasterOnReceive)
    {
//        PRINTF("This is DSPI_MasterSignalEvent_t\r\n");
//        PRINTF("Master receive data from slave has completed!\r\n");
        isMasterOnReceive = false;
    }
    if (true == isMasterOnTransmit)
    {
//        PRINTF("This is DSPI_MasterSignalEvent_t\r\n");
//        PRINTF("Master transmit data to slave has completed!\r\n");
        isMasterOnTransmit = false;
    }
    isTransferCompleted = true;
}
static void spi_cs_init(void)
{
    gpio_pin_config_t led_config = {
        kGPIO_DigitalOutput, 0,
    };
	GPIO_PinInit(SD_SPI_CS_GPIO, SD_SPI_CS_PIN, &led_config);
}
static void spi_cs_ctr(u8 en)
{
	if(en){
		GPIO_SetPinsOutput(SD_SPI_CS_GPIO, 1<<SD_SPI_CS_PIN);
	}else{
		GPIO_ClearPinsOutput(SD_SPI_CS_GPIO, 1<<SD_SPI_CS_PIN);
	}
}

static void spi_dma_init(void)
{
    edma_config_t edmaConfig = {0};

    EDMA_GetDefaultConfig(&edmaConfig);
    EDMA_Init(SD_SPI_DMA_BASEADDR, &edmaConfig);
    DMAMUX_Init(SD_SPI_DMA_MUX_BASEADDR);

