mynamelcz/NXP_KW41Z/DEV/SPI_SD/spi_sd.c
}



static void spi_init(void)
{
    spi_obj.cs_str = spi_cs_ctr;
	spi_cs_init();
	spi_dma_init();
	DRIVER_SD_SPI.Initialize(DSPI_MasterSignalEvent_t);
    DRIVER_SD_SPI.PowerControl(ARM_POWER_FULL);
    DRIVER_SD_SPI.Control(ARM_SPI_MODE_MASTER | ARM_SPI_CPOL0_CPHA1, SD_CLK_SPEED_LOW);
}

static void spi_send_buf(const u8 *pData, uint32_t Size)
{
    isTransferCompleted = false;
    isMasterOnTransmit = true;
    DRIVER_SD_SPI.Send(pData, Size);
    while (!isTransferCompleted){;}
}

static void spi_read_buf(uint8_t *pData, uint32_t Size)
{
    isTransferCompleted = false;
    isMasterOnReceive = true;
    DRIVER_SD_SPI.Receive(pData, Size);
	while (!isTransferCompleted){;}
}

static u8 spi_send_read_byte(u8 dat)
{
	u8 tmp = dat;
    isTransferCompleted = false;
    isMasterOnTransmit = true;
    DRIVER_SD_SPI.Send(&tmp, 1);
    while (!isTransferCompleted){;}
	
	isTransferCompleted = false;
    isMasterOnReceive = true;
    DRIVER_SD_SPI.Receive(&tmp, 1);
	while (!isTransferCompleted){;}
	
	return tmp;
}
static u8 spi_ioctr(u32 cmd, void *buf)
{
	u8 res = false;
	u32 dat32  = 0;
	switch(cmd){
		case SPI_SET_SPEED_CMD:
			 dat32 = *((u32 *)(buf));
             DRIVER_SD_SPI.Control(SPI_SET_SPEED_CMD,dat32);
			 res = true;
			 return res;
		default:
			break;
	}
	return res;
}
__spi_ctr_obj spi_obj = {
	.cs_str = NULL,
	.init 	= spi_init,
	.read   = spi_read_buf,
	.write  = spi_send_buf,
	.w_r_byte = spi_send_read_byte,
	.io_ctr = spi_ioctr,
};

__spi_sd_obj spi_sd_obj = {

	.init 	= sd_init,
	.read 	= sd_read_blk,
	.write 	= sd_write_blk,
	.io_ctr = sd_io_control,
	.status = sd_get_state,
};
 

#endif

